package CyberPunkProject;

import java.util.Scanner;

public class Launcher {
	static Me i = new Me();
	static Weapon w = new Weapon();
	static Reinforcement re = new Reinforcement();
	static Job j = new Job();
	static Skill s = new Skill();
	static Train t = new Train();
	static Portion p = new Portion();
	static House h = new House();
	// static Name n = new Name();

	public static void main(String[] args) {
		System.out.println("****************CyberPunk Game Start****************");
		System.out.println("****************************************************");
		System.out.println("\n" + " _____         _                 ______                _    \n"
				+ "/  __ \\       | |                | ___ \\              | |   \n"
				+ "| /  \\/ _   _ | |__    ___  _ __ | |_/ / _   _  _ __  | | __\n"
				+ "| |    | | | || '_ \\  / _ \\| '__||  __/ | | | || '_ \\ | |/ /\n"
				+ "| \\__/\\| |_| || |_) ||  __/| |   | |    | |_| || | | ||   < \n"
				+ " \\____/ \\__, ||_.__/  \\___||_|   \\_|     \\__,_||_| |_||_|\\_\\\n"
				+ "         __/ |                                              \n"
				+ "        |___/                                               \n" + " ");
		System.out.println(" ");
		System.out.println(" ");
		TextRectangle.main(args);
		// 이름, 직업 설정
		Name.setName();
		j.chooseJob();
		Jobstory.printJobStory();
		System.out.println("게임에 입장했습니다 ! ");
		outerLoop: while (true) {
			System.out.println("**************************************************************");
			System.out.println("장소를 선택하세요 . ");
			System.out.println("0. 내 정보 // 1. 길거리 // 2. 무기 상점 // 3. 신체 강화 // 4. 집 // 5. 훈련소 // 6. 포션 상점");
			System.out.println("**************************************************************");
			int placenum;
			Scanner place = new Scanner(System.in);
			while (true) {
				if (place.hasNextInt()) {
					placenum = place.nextInt();
					break;
				} else {
					place.next(); // 잘못된 입력을 버림
				}
			}
			switch (placenum) {
			// 정보
			case (0) -> {
				System.out.println("내 정보 :  ");
				i.printMyInfo();
				System.out.println(" ");
			}
			// 전투
			case (1) -> {
				Battle b = new Battle();
				if (Me.level % 5 == 0 & Me.level != 0) {
					b.boss_battle();
				} else {
					System.out.println(" ");
					System.out.println("길거리로 나왔습니다 . ");
					b.villain_battle();
					System.out.println(" ");
				}

			}
			// store
			case (2) -> {
				System.out.println(" ");
				System.out.println("무기 상점에 입장했습니다 . ");
				System.out.println(" ");
				w.getWeapon();

			}
			// reinforcement
			case (3) -> {
				System.out.println(" ");
				System.out.println("신체 강화소에 입장했습니다 . ");
				System.out.println(" ");
				System.out.println("어서오세요 ! 어떤 것을 구매하러 오셨나요? ");
				System.out.println("파츠와 칩을 신체에 이식해드립니다. ");
				System.out.println("둘다 공통적으로 스킬이 추가되며, 신체 한계치가 20, 10씩 증가합니다. ");
				System.out.println(" ");
				System.out.println("이식할 항목을 선택하세요 :  ");
				System.out.println("1. 파츠 구매 // 2. 칩 구매 ");
				System.out.println(" ");
				Scanner rein = new Scanner(System.in);
				int reinforce = rein.nextInt();

				switch (reinforce) {

				case (1) -> {
					re.BuyingParts();
					System.out.println(" ");
					if (i.mybodyLimit >= i.maxbodyLimit) {
						System.out.println(" ");
						System.out.println("으악 ! 몸이... 몸이 이상해!!! ");
						System.out.println("신체 한계치를 초과했습니다 !  ");
						System.out.println("------------------- 사이버 사이코가 되었습니다 ------------------- ");
						System.out
								.println("\n" + "\n" + "#############@@$~,,.   ,~~:,*##=,,,,!#$*;,,!#$##@@@@##@@@@#@\n"
										+ "$$$$$$$$$$$$$!;.. ,,   .;**~$*!!--;-=$=!-.:*=**!$$####@@@@@@\n"
										+ "$$$$$$$$$$#:-  ..  .,...,=!~$,. .,*=#=;.,,!**!!!!!*=###@@#@@\n"
										+ "$$$$$$$$$!..   ,..  :,=, ,;;=    ;##=$$..~=***!!!!!*###@@##@\n"
										+ "########$...   . .   .!!...,*.  .*=*=#$. :=***!!!!!!*##@@#@@\n"
										+ "$$$$$$#$!-..     ..   ;#*!-. .  ~=:!##$:.!=***!!!!!!*$####@@\n"
										+ "#####$#~....  .  ,-..~$*@*:-.   :-;$@##$-*=***!!!!!!!$####@@\n"
										+ "######*.....  .. ,!.,$!!@*.!~~,,.:*####@=*==**!!!!!!!*=###@@\n"
										+ "#####$-..   ...  .!~!*::*@;.!*=*;*=#=;*##===****!!!!!!*=#@@@\n"
										+ "#####:...   ...   ;~#*!;!=$~*=#=*=#**;;$@#==**!=*!!!!!!=@@@@\n"
										+ "@@@@#!,.. ..-~.. .,!@=!.~*$##@@@@#=:*.~$#@==***$*!!!!!!*@@@@\n"
										+ "@@@@@#~.. ..,;,   ,#@=:~,:$##!~!@@*~;:!##@$**!*=*!!!!!!!@@@@\n"
										+ "@@@@@*..   ..~-. .;#!::::;#@#, ,@@*~:;$#$#$**===*!!!!!!!#@@@\n"
										+ "@@@@!,...  ,.;!.,.*#*:~~:*@@#, ,@#;~:;*###$**=$$*!!!!!!*#@@@\n"
										+ "@@#=;....  ..**--;##!~!**=$@@=!$@=:=!=!:$#@=*=$$*!!!!!!!$@@@\n"
										+ "#$*!-.,,    ,**--:@*~:!  ;=;@@@@#;!* .:!#@@=*=$=*!!!!!!!=#@@\n"
										+ "=!!! ...... .-!-.-#*~::..:$=!!=$=!*! .:#*##=*==**!!!!!!=###@\n"
										+ "!!!!~,.....  .,;.,*;,~:~~!$$,,,==#==::=!*#$**=**!!!!!!!#####\n"
										+ "!!!!;.... .   ,.: ;=~.:##$=@#-.-=@$$##!*$#=**=*!!!!!!!$#####\n"
										+ "!!!!-.... . ..:~-..*:-,-;!$*=-,-*=;=;*==;=*=**!!!!!!!*######\n"
										+ "!!!! . ... .  ,!;~ ;-,,;*$:;~:~;!:,~$$;,~;***!!!!:;!!!*#####\n"
										+ "!!!!;~.....;-. ,!;.,-~ .:;.;.~-**-- ,,.::***!!!!;..;!!*#####\n"
										+ "!!!!.. ...-!!,..*!~.!-,. ,.;~;~**:-,...;;***!!!,.-!!!*$#####\n"
										+ "!!!~.  ...-!!!:~!!;.~;-.,:. :;;=*  :!.~-***!!!-.-;;;!*=@####\n"
										+ "!!!*-  ...;!!!!!!!=,,!~~..  ,!~==  .--~~**=*!;..!;,;!*######\n"
										+ "!!!=#*,..-!!!!!!!!=,.;:~,   .!=$!    .:,*=$*!,-:...!!=@#####\n"
										+ "!!!*##;..~!!!!!!!!=; -~;     ,*:--,. ~!=*=$=..;....;!=######\n"
										+ "!!!!*$$!.~!!!!!!!*$= ..~,~,-~-;~;;!:-,!=*=$;.,~....!!=######\n"
										+ "!!!!!$##..-!~;!!!**=;  ..~=**;!:!;=~.-***=*,.~,...:!!=######\n"
										+ "*!!!*###!~. .;!!!!*=$;. . -!~**!!;-.!***==~.-. .,:!!@@######\n"
										+ "$!!!*###@*,~;;!!!!!!*$;.   .,--,,,.****=$*~..  .!!!*$######@\n"
										+ "#!!!*####$~:!;!!!!!!*$$;   :,!*!~~ !**=$$*:~...:!!!!*######@\n"
										+ "#*!!!=###~.;!!!!!!!!*$$$~ ...,,,...**$$$$!.. .~!!!!!$######@\n" + "");
						break outerLoop;
//						System.out.println("레벨이 5 감소하며, 능력치가 20% 감소합니다.  ");
//						i.level -= 5;
//						i.maxHp = i.maxHp * (80/100);
//						i.maxMp = i.maxMp * (80/100);
//						i.defense = i.defense * (80/100);
//						i.money = i.money * (80/100);
//						System.out.println("보유 칩과 파츠 중, 각각 한개가 파괴됩니다.  ");
//						System.out.println(i.mypartsName);
					}
				}
				case (2) -> {
					re.buyingChip();
					System.out.println(" ");
					if (i.mybodyLimit >= i.maxbodyLimit) {
						System.out.println(" ");
						System.out.println("신체 한계치를 초과했습니다 !  ");
						System.out.println("으악 ! 몸이 이상해.....! ");
						System.out.println("------------------- 사이버 사이코가 되었습니다 ------------------- ");
						System.out
								.println("\n" + "\n" + "#############@@$~,,.   ,~~:,*##=,,,,!#$*;,,!#$##@@@@##@@@@#@\n"
										+ "$$$$$$$$$$$$$!;.. ,,   .;**~$*!!--;-=$=!-.:*=**!$$####@@@@@@\n"
										+ "$$$$$$$$$$#:-  ..  .,...,=!~$,. .,*=#=;.,,!**!!!!!*=###@@#@@\n"
										+ "$$$$$$$$$!..   ,..  :,=, ,;;=    ;##=$$..~=***!!!!!*###@@##@\n"
										+ "########$...   . .   .!!...,*.  .*=*=#$. :=***!!!!!!*##@@#@@\n"
										+ "$$$$$$#$!-..     ..   ;#*!-. .  ~=:!##$:.!=***!!!!!!*$####@@\n"
										+ "#####$#~....  .  ,-..~$*@*:-.   :-;$@##$-*=***!!!!!!!$####@@\n"
										+ "######*.....  .. ,!.,$!!@*.!~~,,.:*####@=*==**!!!!!!!*=###@@\n"
										+ "#####$-..   ...  .!~!*::*@;.!*=*;*=#=;*##===****!!!!!!*=#@@@\n"
										+ "#####:...   ...   ;~#*!;!=$~*=#=*=#**;;$@#==**!=*!!!!!!=@@@@\n"
										+ "@@@@#!,.. ..-~.. .,!@=!.~*$##@@@@#=:*.~$#@==***$*!!!!!!*@@@@\n"
										+ "@@@@@#~.. ..,;,   ,#@=:~,:$##!~!@@*~;:!##@$**!*=*!!!!!!!@@@@\n"
										+ "@@@@@*..   ..~-. .;#!::::;#@#, ,@@*~:;$#$#$**===*!!!!!!!#@@@\n"
										+ "@@@@!,...  ,.;!.,.*#*:~~:*@@#, ,@#;~:;*###$**=$$*!!!!!!*#@@@\n"
										+ "@@#=;....  ..**--;##!~!**=$@@=!$@=:=!=!:$#@=*=$$*!!!!!!!$@@@\n"
										+ "#$*!-.,,    ,**--:@*~:!  ;=;@@@@#;!* .:!#@@=*=$=*!!!!!!!=#@@\n"
										+ "=!!! ...... .-!-.-#*~::..:$=!!=$=!*! .:#*##=*==**!!!!!!=###@\n"
										+ "!!!!~,.....  .,;.,*;,~:~~!$$,,,==#==::=!*#$**=**!!!!!!!#####\n"
										+ "!!!!;.... .   ,.: ;=~.:##$=@#-.-=@$$##!*$#=**=*!!!!!!!$#####\n"
										+ "!!!!-.... . ..:~-..*:-,-;!$*=-,-*=;=;*==;=*=**!!!!!!!*######\n"
										+ "!!!! . ... .  ,!;~ ;-,,;*$:;~:~;!:,~$$;,~;***!!!!:;!!!*#####\n"
										+ "!!!!;~.....;-. ,!;.,-~ .:;.;.~-**-- ,,.::***!!!!;..;!!*#####\n"
										+ "!!!!.. ...-!!,..*!~.!-,. ,.;~;~**:-,...;;***!!!,.-!!!*$#####\n"
										+ "!!!~.  ...-!!!:~!!;.~;-.,:. :;;=*  :!.~-***!!!-.-;;;!*=@####\n"
										+ "!!!*-  ...;!!!!!!!=,,!~~..  ,!~==  .--~~**=*!;..!;,;!*######\n"
										+ "!!!=#*,..-!!!!!!!!=,.;:~,   .!=$!    .:,*=$*!,-:...!!=@#####\n"
										+ "!!!*##;..~!!!!!!!!=; -~;     ,*:--,. ~!=*=$=..;....;!=######\n"
										+ "!!!!*$$!.~!!!!!!!*$= ..~,~,-~-;~;;!:-,!=*=$;.,~....!!=######\n"
										+ "!!!!!$##..-!~;!!!**=;  ..~=**;!:!;=~.-***=*,.~,...:!!=######\n"
										+ "*!!!*###!~. .;!!!!*=$;. . -!~**!!;-.!***==~.-. .,:!!@@######\n"
										+ "$!!!*###@*,~;;!!!!!!*$;.   .,--,,,.****=$*~..  .!!!*$######@\n"
										+ "#!!!*####$~:!;!!!!!!*$$;   :,!*!~~ !**=$$*:~...:!!!!*######@\n"
										+ "#*!!!=###~.;!!!!!!!!*$$$~ ...,,,...**$$$$!.. .~!!!!!$######@\n" + "");
						break outerLoop;
					}

				}
				}
			}

			// house
			case (4) -> {
				System.out.println(" ");
				System.out.println("집에 입장했습니다 . ");
				System.out.println(" ");
				h.rest();

			}

			// train
			case (5) -> {
				System.out.println(" ");
				System.out.println("훈련소에 입장했습니다 . ");
				System.out.println(" ");
				System.out.println("어서오세요 ! 어떤 훈련을 하러 오셨나요? ");
				System.out.println("신체 단련과 무기 강화가 준비되어 있습니다. ");
				// System.out.println("둘다 공통적으로 스킬이 추가되며, 신체 한계치가 20, 10씩 증가합니다. ");
				System.out.println(" ");
				System.out.println(" 항목을 선택하세요 :  ");
				System.out.println("1. 무기 강화 // 2. 신체 단련 ");
				System.out.println(" ");
				Scanner train = new Scanner(System.in);
				int trainnum = train.nextInt();
				switch (trainnum) {
				case (1) -> {
					t.upgradeWeapon();
					System.out.println(" ");
				}
				case (2) -> {
					t.reinforceBody();
					System.out.println(" ");
				}
				}
			}
			// portion
			case (6) -> {
				System.out.println(" ");
				System.out.println("포션 상점에 입장했습니다 . ");
				System.out.println(" ");
				p.getPortion();
				System.out.println(" ");

			}

			}

		}
	}

}